Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_PlaygroundBookFormatRef/PlaygroundBookFormatReference-level2.tmx
Source language: en_us
Languages: ja

source: (Default value) Playground logging is on and results are displayed.
ja: （省略時の値）プレイグラウンドログはオンです、そして結果は表示されます。

source: (See PageReference Key in Glossary Property List.)
ja: （PageReferenceキーをグロッサリープロパティリストで見てください。）

source: // Once you determine which Bluetooth services your playground page requires,
ja: // 一旦あなたのプレイグラウンドページが必要とするのはどのBluetoothサービスかをあなたが決定したならば、

source: // Pick a name that matches the types of peripheral your playground
ja: // あなたのプレイグラウンドがサポートする周辺機器の型に合致する名前を選びます、

source: // Place the connection view within the rest of your page's content.
ja: // 接続ビューをあなたのページの内容以外のところに設置します。

source: // Position the connection view in the top right corner.
ja: // 接続ビューを上部右隅に位置させます。

source: // pass an array of CBUUIDs for those services here instead of `nil`.
ja: // それらのサービスのためのCBUUIDからなる配列を `nil` の代わりにそこで渡してください。

source: // supports, such as "Robot", "Speaker", or "Light".
ja: // 例えば "Robot", "Speaker", または "Light"。

source: [commands](glossary://command) defines the link to the commands glossary term.
ja: [commands](glossary://command)は、commandsグロッサリー用語へのリンクを定義します。

source: liveView fills the entire live view area, and innerView fills the safe area.
ja: liveViewはライブビュー領域全体を満たします、そしてinnerViewは安全領域をいっぱいにします。

source: theView is used to change properties of the live view, even though it is defined in the hidden code.
ja: theViewは、ライブビューのプロパティを変更するために使われます、たとえそれが非表示コードで定義されるとしてもです。

source: [debugging](glossary://debug) defines the link to the debugging glossary term.
ja: [debugging](glossary://debug)は、debuggingグロッサリー用語へのリンクを定義します。

source: Block comment markers enclose one or more lines of text containing markup delimiters.
ja: ブロックコメントメーカは、１つ以上の行のテキストを含むマークアップ区切り記号に納めます。

source: Definition: The definition of the term.
ja: 定義：用語の定義。

source: First-use link: A reference to the playground page introducing the term.
ja: 「使い始め」リンク：その用語を取り入れているプレイグラウンドページへの参照。

source: Note: Game controllers must be powered on before launching a playground that uses them.
ja: 注意: ケームコントローラは、それを使うプレイグラウンドが起動する前に電源を入れられなければなりません。

source: Optional.
ja: 任意。

source: Single-line comment markers consist of one line of text containing markup delimiters.
ja: 単一行コメントマーカーは、マークアップ区切り記号を含んでいる一行のテキストから成ります。

source: Term: The concept defined by the glossary entry.
ja: 用語：グロッサリー登録項目によって定義される概念。

source: chapter Name key value is the value of the Name key of the Manifest.plist file for the chapter.
ja: chapter Name key valueは、その章のためのManifest.plistファイルのNameキーの値です。

source: hints: A new array of hints for the Hint button.
ja: hints: Hintボタンのための新しいヒントの配列。

source: key: The key to find in the store.
ja: key: 保管庫の中で捜すキー。

source: message: A PlaygroundValue Enumeration with an associated value.
ja: message: 関連値値を持つPlaygroundValue列挙。

source: message: A message displayed in the Hints area.
ja: message: Hint領域で表示されるメッセージ。

source: message: A message encoded as a PlaygroundValue Enumeration.
ja: message: PlaygroundValue列挙としてエンコードされるメッセージ。

source: remoteLiveViewProxy: The live view connected to the proxy object.
ja: remoteLiveViewProxy: プロキシオブジェクトに接続されるライブビュー。

source: solution: An optional solution string.
ja: solution: 任意の解答文字列。

source: Issuing%20Commands, the second component of the path, is the value of the Name key of the Manifest.plist file for the page Exercise1.playgroundpage.
ja: Issuing%20Commands、パスの第２のコンポーネントは、ページExercise1.playgroundpageのためのManifest.plistファイルのNameキーの値です。

source: Commands, the first component of the PageReference for command, is the value of the Name key of the Manifest.plist file for the chapter Document1.playgroundchapter.
ja: Commands、commandのためのPageReferenceの最初のコンポーネントは、章Document1.playgroundchapterのためのManifest.plistファイルのNameキーです。

source: Figure 1-1 shows a screenshot from Learn to Code 1.
ja: 図 1-1は、「コードを学ぶ１」からのスクリーンショットを示します。

source: Figure 1-1Learn to Code 1
ja: 図 1-1 「コードを学ぶ 1」

source: Figure 1-2Package folder hierarchy
ja: 図 1-2 パッケージフォルダ階層

source: Figure 10-1 shows the playground page rendered from Listing 10-1.
ja: 図 10-1 は、コード出力 10-1から描画されるプレイグラウンドページを示します。

source: Figure 10-1Playground page with hidden code
ja: 図 10-1 非表示コードを持つプレイグラウンドページ

source: Figure 11-1 shows customized code completion in the Learn to Code 1 playground book.
ja: 図 11-1 は、「Learn to Code 1」プレイグラウンドブックでのカスタマイズされたコード補完を示します。

source: Figure 11-1Customized code completion
ja: 図 11-1 カスタマイズされたコード補完

source: Figure 12-1Tools menu
ja: 図 12-1 Toolsメニュー

source: Figure 12-2 shows a view of the full glossary from Learn to Code 1.
ja: 図 12-2 は、「Learn to Code 1」から完全なグロッサリーの見え方を示します。

source: Figure 12-2Playground book glossary
ja: 図 12-2 プレイグラウンドブックグロッサリー

source: Figure 12-3 shows a playground page where the word “bug” links to the related glossary term.
ja: 図 12-3 は、単語「bug」が関連グロッサリー用語にリンクする状態でのプレイグラウンドページを示します。

source: Figure 12-3Glossary link and popover
ja: 図 12-3 グロッサリーリンクとポップオーバー

source: Figure 13-1Glossary term
ja: 図 13-1 グロッサリー用語

source: Figure 13-2 shows some of the glossary terms from Learn to Code 1, such as algorithm, arithmetic operator, and argument.
ja: 図 13-2 は、「Learn to Code 1」からいくつかのグロッサリー用語を示します、例えばalgorithm、arithmetic operator、そしてargumentなど。

source: Figure 13-2Glossary term names
ja: 図 13-2 グロッサリー用語名

source: Figure 14-1 shows a page from Learn to Code 1 that contains links to two glossary terms: commands and debugging.
ja: 図 14-1は、「Learn to Code 1」からページを示し、それは２つのグロッサリー用語へのリンク：commandsとdebuggingを含みます。

source: Figure 14-1Glossary links on a playground page
ja: 図 14-1 プレイグラウンドページ上のグロッサリーリンク

source: Figure 15-1Hint button
ja: 図 15-1 Hintボタン

source: Figure 15-2Hints and spoilers
ja: 図 15-2 ヒントとスポイラー

source: Figure 19-1A directory structure corresponding to the JSON example shown in Creating Subscriptions.
ja: 図 19-1 「サブスクリプションの作成」で示されるJSON例と対応するディレクトリ構造。

source: Figure 19-2Unlocalized feed URLs point directly to feeds, while localized feeds first point to a locales dictionary.
ja: 図 19-2 非現地語化フィードURLは直接にフィードを指し示します、一方で現地語化フィードは幾つかのロケールを含んだある辞書を最初に指し示します。

source: Figure 2-1 shows a table of contents with two chapters.
ja: 図 2-1 は、２つの章を持つ目次を示します。

source: Figure 2-1Chapters in the table of contents
ja: 図 2-1 目次の中のいくらかの章

source: Figure 2-2 shows a custom image used for the book icon.
ja: 図 2-2 は、ブックアイコンに使われるカスタム画像を示します。

source: Figure 2-2Custom book icon
ja: 図 2-2 カスタムブックアイコン

source: Figure 3-1 shows an example property list using the keys available in the chapter manifest file.
ja: 図 3-1 は、章マニフェストファイルにおいて利用可能なキーを使って、実例プロパティリストを示します。

source: Figure 3-1Chapter manifest property list
ja: 図 3-1 章マニフェストプロパティリスト

source: Figure 3-2Chapter name in the table of contents
ja: 図 3-2 目次のおける章名

source: Figure 3-3 shows a table of contents with two pages for the first chapter.
ja: 図 3-3 は、最初の章のための２つのページを持つ目次を示します。

source: Figure 3-3Pages in the table of contents
ja: 図 3-3 目次でのページ

source: Figure 31-1A playground page’s connection view provided by the PlaygroundBluetooth framework.
ja: 図 31-1 あるプレイグラウンドページの、PlaygroundBluetoothフレームワークによって提供される接続ビュー。

source: Figure 35-1A PlaygroundBluetoothConnectionView instance in the peripheral selection state.
ja: 図 35-1 周辺機器選択状態のPlaygroundBluetoothConnectionViewインスタンス。

source: Figure 4-1Cutscene page in the table of contents
ja: 図 4-1 目次でのカットシーンページ

source: Figure 5-1 shows how the value of LiveViewEdgeToEdge changes the size of the live view.
ja: 図 5-1 は、どのようにLiveViewEdgeToEdgeの値がライブビューのサイズを変更するかを示します。

source: Figure 5-1Effect of the LiveViewEdgeToEdge key value
ja: 図 5-1 LiveViewEdgeToEdgeキーの値の効果

source: Figure 5-2 shows how the value of LiveViewMode affects the initial display of a live view area.
ja: 図 5-2 は、どのようにLiveViewModeの値がライブビューエリアの初期表示に影響するかを示します。

source: Figure 5-2Effect of the live view mode key value
ja: 図 5-2 ライブビューモードキー値の効果

source: Figure 5-3Playground page in the table of contents
ja: 図 5-3 目次でのプレイグラウンドページ。

source: Figure 5-4 shows a playground with results for each of the executed statements.
ja: 図 5-4 は、実行された文それぞれの結果とともにプレイグラウンドを示します。

source: Figure 5-4Playground results
ja: 図 5-4 プレイグラウンドの結果。

source: Figure 5-5Live view poster image
ja: 図 5-5 ライブビューポスター画像

source: Figure 6-1A simple annotated page
ja: 図 6-1 単純な注釈ページ

source: Figure 7-1 shows a playground page with an inline editable area for entering the end of a range in a for loop.
ja: 図 7-1 は、forループの終わり範囲を入力するためのインライン編集エリアを持つプレイグラウンドページを示します。

source: Figure 7-1Playground page with an inline editable area
ja: 図 7-1 インライン編集エリアを持つプレイグラウンドページ

source: Figure 7-2 shows a playground page that allows the user to enter the source code for the body of a for loop.
ja: 図 7-2 は、ユーザにforループの本文用のソースコードを入力させるプレイグラウンドページを示します。

source: Figure 7-2Playground page with an editable for loop
ja: 図 7-2 ループに対する編集を持つプレイグラウンド

source: Figure 7-3Editable code on a page
ja: 図 7-3 あるページ上の編集可能コード

source: Figure 9-1Int popover
ja: 図 9-1 Intポップオーバー

source: Listing 10-1 uses hidden code to show a live view.
ja: コード出力 10-1 は、非表示コードをライブビューに対して使います。

source: Listing 10-1Hiding the code to show a live view
ja: コード出力 10-1 ライブビューを表示するための隠されたコード

source: Listing 11-1 is a good example of the most common way of using -code-completion.
ja: コード出力 11-1 は、-code-completionを使う最も一般的な方法の良い例です。

source: Listing 11-1Managing completions
ja: コード出力 11-1 補完を管理する

source: Listing 11-2 compares the way you use the identifier namespace with the way you use the description namespace.
ja: コード出力 11-2は、あなたがidentifier名前空間を使う方法とあなたがdescription名前空間を使う方法を比較します。

source: Listing 11-2Managing overloads
ja: コード出力 11-2オーバーロードを管理する

source: Listing 14-1 shows the snippet of markup defining the glossary links shown in Figure 14-1.
ja: コード出力 14-1 は、図 14-1で表示されるグロッサリーリンクを定義しているマークアップのスニペットを示します。

source: Listing 14-1Glossary link markup snippet
ja: コード出力 14-1 グロッサリーリンクマークアッブスニペット

source: Listing 16-1Example Hints.plist file
ja: コード出力 16-1 例 Hints.plist ファイル

source: Listing 6-1 shows the source code for the page shown in Figure 6-1.
ja: コード出力 6-1 は、図 6-1 で表示されるページのためのソースコードを示します。

source: Listing 6-1Source code for a simple annotated page
ja: 図 6-1 単純な注釈付きページのためのソースコード

source: Listing 7-1Source code for an inline editable area
ja: コード出力 7-1 インライン編集エリアのためのソースコード

source: Listing 7-2 shows the source code for the page shown in Figure 7-2.
ja: コード出力 7-2 は、図 7-2で示されるページのためのソースコードを示します。

source: Listing 7-2Source code for a multiline editable area
ja: コード出力 7-2 複数行編集エリアのためのソースコード

source: Listing 7-3Playground source page (Chapter1.playgroundchapter/Page1.playgroundpage)
ja: コード出力 7-3 プレイグラウンドソースページ（Chapter1.playgroundchapter/Page1.playgroundpage）

source: Listing 7-4Playground destination page (Chapter1.playgroundchapter/Page2.playgroundpage)
ja: コード出力 7-4 プレイグラウンド行き先ページ（Chapter1.playgroundchapter/Page2.playgroundpage）

source: Listing 7-5Editable code page source
ja: コード出力 7-5 編集コードページソース

source: Listing 9-1Untyped and typed placeholders
ja: コード出力 9-1 型指定されないそして型指定されるプレースホルダー

source: Required.
ja: 必須。

source: Table 1-1 describes the folder name extensions and lists their locations in the hierarchy.
ja: 表 1-1は、フォルダ名拡張子を記述して、それらの階層中の位置を一覧にします。

source: Table 1-1Folder name extensions
ja: 表 1-1 フォルダ名拡張子

source: Table 1-2 describes the folders in the package structure and lists the containing folder for each.
ja: 表 1-2は、パッケージ構造の中のフォルダを記述して、それぞれに含まれているフォルダを一覧にします。

source: Table 1-2Package structure folder names
ja: 表 1-2さまざまなパッケージ構造フォルダ名

source: Table 1-3 describes the resources folder names and lists their containing folders.
ja: 表 1-3 は、リソースフォルダ名を記述して、それらが含んでいるフォルダを一覧にします。

source: Table 1-3 describes the shared code folder names and lists their containing folders.
ja: 表 1-3 は、共有コードフォルダ名を記述して、それらが含んでいるフォルダを一覧にします。

source: Table 1-3Shared code folder names
ja: 表 1-3 共有コードフォルダ名

source: Table 1-4Public and private resources folder names
ja: 表 1-4パブリックおよびプライベートリソースフォルダ名

source: Table 1-5 describes the folder name extension and lists its locations in the hierarchy.
ja: 表 1-5は、フォルダ名拡張子を記述して、階層におけるそれの位置を一覧にします。

source: Table 1-5Localized resources folder extensions
ja: 表 1-5ローカライズリソースフォルダ拡張子

source: Table 1-6 describes the specially named files and lists their containing folders.
ja: 表 1-6 は、特有名前ファイルを記述して、それらを含んでいるフォルダを一覧にします。

source: Table 1-6Specially named files
ja: 表 1-6 特有名前ファイル

source: Table 11-1Values for the namespace argument
ja: 表 11-1 名前空間引数のための値

source: Table 13-1 describes each top-level key in the glossary property list, its type, and whether the key is required.
ja: 表 13-1 は、グロッサリープロパティリストでの各トップレベルキー、そしてそのキーが必須かどうかを記述します。

source: Table 13-1Glossary property list keys
ja: 表 13-1 グロッサリープロパティリストキー

source: Table 13-2 describes each key for a term dictionary, its type, and whether the key is required.
ja: 表 13-2 は、用語ディクショナリのための各キー、それの型、そしてそのキーが必須かどうかを記述します。

source: Table 13-2Term dictionary keys
ja: 表 13-2 用語ディクショナリキー

source: Table 13-3 describes each key for the FirstUse dictionary, its type, and whether the key is required.
ja: 表 13-3 は、FirstUseディクショナリに対する各キー、それの型、そしてそのキーが必須かどうかを記述します。

source: Table 13-3First use dictionary keys
ja: 表 13-3 「使い始め」ディクショナリのキー

source: Table 2-1 describes each key for a book, its type, and whether the key is required.
ja: 表 2-1 は、ブックのための各キー、それの型、そしてそのキーが必須とされるかどうかを記述します。

source: Table 2-1Keys for a book
ja: 表 2-1 ブックに対する様々なキー

source: Table 3-1 describes each key for a chapter, its type, and whether the key is required.
ja: 表 3-1 は、ある章のための各キーを、そしてそのキーが必須かどうかを記述します。

source: Table 3-1Keys for a chapter
ja: 表 3-1 ある章のための様々なキー

source: Table 4-1 describes each key for a cutscene page, its type, and whether the key is required.
ja: 表 4-1 は、カットシーンページのための各キー、それの型、そしてそのキーが必須とされるかどうかを記述します。

source: Table 4-1Keys for a cutscene page
ja: 表 4-1 あるカットシーンページに対するキー

source: Table 5-1 describes each key for a playground page, its type, and whether the key is required.
ja: 表 5-1 は、プレイグラウンドページのための各キー、それの型、そしてそのキーが必須とされるかどうかを記述します。

source: Table 5-1Keys for a playground page
ja: 表 5-1 あるプレイグラウンドページに対するキー

source: Table 5-2 describes each key for the CodeCopySetup dictionary, its type, and whether the key is required.
ja: 表 5-2 は、CodeCopySetupディクショナリに対する各キー、それの型、そしてそのキーが必須かどうかを記述します。

source: Table 5-2Keys for a CodeCopySetup dictionary
ja: 表 5-2 CodeCopySetupディクショナリのためのキー

source: Table A-1 describes the available frameworks, including any key prefixes used by the classes, methods, functions, types, or constants of the framework.
ja: 表 A-1 は利用可能なフレームワークを解説して、クラス、メソッド、関数、型、またはフレームワークによって使われるあらゆるキー接頭辞を含んでいます。

source: Table A-1Playground book frameworks
ja: 表 A-1 プレイグラウンドブックフレームワーク

source: Figure 1-2 shows the general hierarchy of files and folders for the playground book package format.
ja: 図 1-2は、playgroundブックパッケージ形式のためのファイルとフォルダの一般的な階層を示します。

source: A PlaygroundBluetoothConnectionView.Item that holds information about the specified peripheral.
ja: あるPlaygroundBluetoothConnectionView.Item、それは指定の周辺機器についての情報を保持します。

source: A PlaygroundBluetoothConnectionView.Item instance which is displayed within a PlaygroundBluetoothConnectionView.
ja: PlaygroundBluetoothConnectionView.Itemインスタンス、それはPlaygroundBluetoothConnectionView内部に表示されます。

source: A PlaygroundKeyValueStore object provides access to the key-value store for a playground book.
ja: PlaygroundKeyValueStoreオブジェクトは、プレイグラウンドブックのためのキー値保管庫へのアクセスを提供します。

source: A PlaygroundPage object provides methods and properties that represent the state of a playground page, enabling you to interact with Swift Playgrounds.
ja: PlaygroundPageオブジェクトはメソッドとプロパティを提供します、それはプレイグラウンドページの状態を表して、あなたにSwift Playgroundsと相互作用させます。

source: A UILayoutGuide that can be used to constrain the size of a view to the live view safe area.
ja: UILayoutGuide、それはあるビューの大きさをライブビュー安全領域に制約するために使われることができます。

source: A Boolean controlling the initial size of the live view.
ja: ライブビューの初期サイズを制御するブール。

source: A Boolean value indicating whether the currently active playground book has previously connected to a peripheral.
ja: 現在作動中のプレイグラウンドブックが以前にある周辺機器に接続したかどうかを指し示すブール値。

source: A Boolean value indicating whether the newly discovered peripheral should show up in the connection view.
ja: 新しく発見された周辺機器が接続ビューに現れるべきかどうかを指し示すブール値。

source: A Boolean value that determines whether the central manager is scanning for peripherals.
ja: あるブール値、それはセントラルマネージャが周辺機器を走査しているかどうかを明らかにします。

source: A Boolean value that indicates whether indefinite execution is enabled.
ja: 無期限の実行が可能にされるかどうかを指し示すブール値。

source: A chapter in the book
ja: ブックのひとつの章

source: A connection view’s central manager is scanning for nearby peripherals.
ja: 接続ビューの持つセントラルマネージャは、近くの周辺機器を走査中です。

source: A data source that provides subviews for available peripherals.
ja: 利用可能な周辺機器のためのサブビューを提供するデータソース。

source: A delegate that can receive messages from the central manager by adopting the PlaygroundBluetoothCentralManagerDelegate protocol.
ja: あるデリゲート、それはセントラルマネージャからメッセージを受け取ることがPlaygroundBluetoothCentralManagerDelegateプロトコルの採用によって可能です。

source: A delegate that can receive messages from the live view by conforming to the PlaygroundRemoteLiveViewProxyDelegate Protocol.
ja: 委任先、それはメッセージをライブビューからPlaygroundRemoteLiveViewProxyDelegateプロトコルに準拠することによって受け取ることができます。

source: A delegate you supply to make decisions about which peripherals are displayed in the view.
ja: どの周辺機器がビューにおいて表示されるかについて決定するためにあなたが提供するデリゲート。

source: A delegate you use to respond to peripheral discovery and manage the lifecycle of connections.
ja: あなたが周辺機器発見に応答するためにそして接続のライフサイクルを管理するために使うデリケート。

source: A delegate you use to respond to user- and system-initiated interactions with the central manager’s connection view.
ja: セントラルマネージャの持つ接続ビューとの、ユーザ- およびシステム-着手の相互作用に応答するためにあなたが使用するデリゲート。

source: A description that shows up in detail views before opening a book in the subscription.
ja: サブスクリプションの中のあるブックを開く前に詳細ビューにおいて姿を見せる解説。

source: A developer-defined version number for the book.
ja: ブックのための開発者定義のバージョン番号。

source: A dictionary containing any advertisement data that the peripheral provides.
ja: 周辺機器が提供する何らかの告知データを含んでいる辞書。

source: A dictionary defining a glossary term.
ja: グロッサリー用語を定義しているディクショナリ。

source: A dictionary defining a link to the page where the term is first used.
ja: 用語が最初に使われるところのページへのリンクを定義するディクショナリ。

source: A dictionary of dictionaries.
ja: いくらかのディクショナリからなるあるディクショナリ

source: A dictionary of glossary term dictionaries.
ja: いくらかのグロッサリー用語ディクショナリからなるあるディクショナリ。

source: A dictionary of key-value pairs that specifies instructions shown to a user when copying content between playground pages.
ja: キー値ペアからなるディクショナリで、それはプレイグラウンドページ間で内容をコピーする時にユーザに表示される説明書を指定します。

source: A dictionary that defines a link and title for the first use of a glossary term.
ja: あるグロッサリー用語の「使い始め」に対するリンクとタイトルを定義するディクショナリ。

source: A feed is a downloadable list of items that apps and websites understand.
ja: あるフィードは、あるダウンロード可能な幾つかの項目のリストで、アプリとウェブサイトが理解できるものです。

source: A file in the Resources folder of the page that contains the formatted text for the hint.
ja: そのページのResourcesフォルダの中のあるファイルで、ヒントのための書式指定されたテキストを含みます。

source: A folder containing localized assets for the specified locale
ja: 特定のロケールに対してローカライズされた資産を含んでいるフォルダ

source: A folder containing private resources, such as images, text files, hints, and localization files
ja: プライベートリソース、例えば画像、テキストファイル、ヒント、そしてローカライズファイルを含んでいるフォルダ

source: A folder containing public resources, such as images and text files
ja: パブリックリソース、例えば画像およびテキストファイルを含んでいるフォルダ

source: A folder containing shared Swift code
ja: 共有されるSwiftコードを含んでいるフォルダ

source: A function that’s called when the connection attempt succeeds or fails.
ja: その接続の試みが成功または失敗する時に呼び出される関数。

source: A hint dictionary specifies the text for a hint and an optional spoiler button title.
ja: ヒントディクショナリは、ヒントのためのテキストおよび任意のスポイラーボタンタイトルを指定します。

source: A hint dictionary with a Content key can't also contain a FileReference key.
ja: Contentキーを持つヒントディクショナリは、さらにまたFileReferenceキーを含むことはできません。

source: A hint dictionary with a FileReference key can't also contain a Content key.
ja: FileReferenceキーを持つヒントディクショナリは、さらにまたContentキーを含むことはできません。

source: A hint may optionally have a spoiler button, which causes the content of the hint to be hidden until the spoiler button is tapped.
ja: ヒントは、随意にスポイラーボタンを持てます、それはヒントの内容がスポイラーボタンがタップされるまで隠されるようにします。

source: A link to a picture of the cover of the book.
ja: ブックの表紙の絵へのリンク。

source: A link to the banner image used to display the book.
ja: ブックを陳列するために使われるバナー画像へのリンク。

source: A link to the localized JSON feed file for the specified locale.
ja: 特定ロケールのための現地語化されたJSONフィードファイルへのリンク。

source: A link to your a zipped copy of the book’s .playgroundbook file.
ja: このブックの持つ.playgroundbookファイルの、あなたのzipされたコピーへのリンク。

source: A localized string corresponding to the current state of the view.
ja: ビューの現在の状態に対応する現地語化された文字列。

source: A localized string that contains firmware update instructions.
ja: ファームウェアアップデート取扱説明書を含む現地語化された文字列。

source: A metadata key name.
ja: メタデータキー名。

source: A metadata key value.
ja: メタデータキー値。

source: A page can include many code-completion delimiters.
ja: あるページは多くのコード補完区切り記号を含むことが出来ます。

source: A page may have one or more hints.
ja: ページは、ひとつ以上のヒントを持てます。

source: A page reference is a two-component path specifying the location of a page in the playground book package.
ja: ページ参照は、プレイグラウンドブックパッケージの中のあるページの位置を指定している２コンポーネントバスです。

source: A playground book is a package—a type of document with a file and folder structure.
ja: playgroundブックは、パッケージ — ファイルとフォルダ構造を持つ文書のひとつの型式です。

source: A property list that defines the attributes for a book, chapter, or page
ja: ブック、章、またはページに対する属性を定義するプロパティリスト

source: A reference to an image used for the book icon.
ja: ブックアイコンに使われる画像への参照。

source: A reference to the key-value store for the current playground or playground book.
ja: 現在のプレイグラウンドまたはプレイグラウンドブックの他のキー値保管庫への参照。

source: A required file with the initial contents of the playground page
ja: プレイグラウンドページの冒頭の内容を持つ必須ファイル

source: A reverse-DNS identifier unique to the book.
ja: ブックに対して特有である逆DNS識別子。

source: A reverse-DNS string for the domain hosting this feed.
ja: このフィードをホストしているドメインの逆DNS文字列。

source: A simple approach is to start with an existing playground book, which you can get by downloading StarterPlaygroundBook: A simple Swift Playground Book.
ja: ひとつの簡単な取り組みは、既存のプレイグラウンドブックで始めることです、それはあなたがStarterPlaygroundBook: A simple Swift Playground Bookをダウンロードすることで取得できます。

source: A simple—yet complete—JSON document looks like this:
ja: ある単純な—未完成の—JSON文書はこのように見えます：

source: A streamlined interface for connecting the central manager for the current playground page to nearby Bluetooth peripherals.
ja: 現在のプレイグラウンドページのためのセントラルマネージャを近くのBluetooth周辺機器に接続するためのストリームラインインターフェイス。

source: A structure that holds information about a peripheral displayed in a connection view.
ja: ある接続ビューの中で表示されるひとつの周辺機器についての情報を保持する構造体。

source: A type that can be displayed as the live view for a playground.
ja: ある型、それはプレイグラウンドのライブビューとして表示されることができます。

source: A type that provides access to a UILayoutGuide for the area of the live view that is not covered by any Swift Playgrounds user interface elements.
ja: ある型、それはUILayoutGuideへのアクセスを、どんなSwift Playgroundsユーザインターフェイス要素によってもカバーされないライブビューの領域に対して提供します。

source: A type that provides access to a UILayoutGuide for the safe area of the live view.
ja: ある型、それはライブビューの安全な領域のUILayoutGuideへのアクセスを提供します。

source: A type that supports receiving asynchronous messages from a playground page.
ja: ある型、それはプレイグラウンドページからの非同期のメッセージの受け取りをサポートします。

source: A type that supports receiving asynchronous messages from an always-on live view.
ja: ある型、それは常時接続のライブビューからの非同期のメッセージの受け取りをサポートします。

source: A type used for encoding a Boolean value.
ja: Boolean値をエンコードするために使われる型。

source: A type used for encoding a date and time.
ja: 日付と時間をエンコードするために使われる型。

source: A type used for encoding a dictionary of key-value pairs.
ja: キー値ペアのディクショナリをエンコードするために使われる型。

source: A type used for encoding a floating point value.
ja: 浮動小数点値をエンコードするために使われる型。

source: A type used for encoding a string value.
ja: 文字列値をエンコードするために使われる型。
